In [1]:
### Aim - Doing this project to predict the Bangluru house price
### Author - Prajwal Ghadi
### Date - 30-11-2021

In [2]:
import numpy as np
import pandas as pd

In [3]:
Dataframe = pd.read_csv('D:/Machine Learning Projects Files/Bangluru House Price/Bengaluru_House_Data.csv')
Dataframe.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [4]:
### Checking unique values for all the columns

for i in Dataframe.columns:
    print(i," = ",Dataframe[i].nunique())

area_type  =  4
availability  =  81
location  =  1305
size  =  31
society  =  2688
total_sqft  =  2117
bath  =  19
balcony  =  4
price  =  1994

In [5]:
#### Columns which are not required for prediction such as area_type, availability, society etc.

columns_to_drop = ['area_type', 'availability', 'society', 'balcony']

df1 = Dataframe.drop(columns_to_drop, axis = 'columns')

for i in df1.columns:
    print(i, ' = ', df1[i].nunique())
    
print('Total Rows and Columns in Dataframe: ', df1.shape)

location  =  1305
size  =  31
total_sqft  =  2117
bath  =  19
price  =  1994
Total Rows and Columns in Dataframe:  (13320, 5)

In [6]:
for i in df1:
    print(df1.columns, df1[i].unique(),'\n')

Index(['location', 'size', 'total_sqft', 'bath', 'price'], dtype='object') ['Electronic City Phase II' 'Chikka Tirupathi' 'Uttarahalli' ...
 '12th cross srinivas nagar banshankari 3rd stage' 'Havanur extension'
 'Abshot Layout']

Index(['location', 'size', 'total_sqft', 'bath', 'price'], dtype='object') ['2 BHK' '4 Bedroom' '3 BHK' '4 BHK' '6 Bedroom' '3 Bedroom' '1 BHK'
 '1 RK' '1 Bedroom' '8 Bedroom' '2 Bedroom' '7 Bedroom' '5 BHK' '7 BHK'
 '6 BHK' '5 Bedroom' '11 BHK' '9 BHK' nan '9 Bedroom' '27 BHK'
 '10 Bedroom' '11 Bedroom' '10 BHK' '19 BHK' '16 BHK' '43 Bedroom'
 '14 BHK' '8 BHK' '12 Bedroom' '13 BHK' '18 Bedroom']

Index(['location', 'size', 'total_sqft', 'bath', 'price'], dtype='object') ['1056' '2600' '1440' ... '1133 - 1384' '774' '4689']

Index(['location', 'size', 'total_sqft', 'bath', 'price'], dtype='object') [ 2.  5.  3.  4.  6.  1.  9. nan  8.  7. 11. 10. 14. 27. 12. 16. 40. 15.
 13. 18.]

Index(['location', 'size', 'total_sqft', 'bath', 'price'], dtype='object') [ 39.07 120.    62.   ...  40.14 231.   488.  ]

In [7]:
df1.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [8]:
df2 = df1.dropna()
df2.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [9]:
df2['bhk'] = df2['size'].apply(lambda x: int(x.split(' ')[0]))

<ipython-input-9-eadc3504d97e>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['bhk'] = df2['size'].apply(lambda x: int(x.split(' ')[0]))

In [10]:
df2.shape

(13246, 6)

In [11]:
df2['bhk'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [12]:
df2[df2.bhk > 20]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [13]:
df2.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [14]:
### This is_float function is created to return the float value and Non-float values

In [15]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [16]:
df2[df2['total_sqft'].apply(is_float)]

                       location       size total_sqft  bath   price  bhk
0      Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1              Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2                   Uttarahalli      3 BHK       1440   2.0   62.00    3
3            Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                      Kothanur      2 BHK       1200   2.0   51.00    2
...                         ...        ...        ...   ...     ...  ...
13315                Whitefield  5 Bedroom       3453   4.0  231.00    5
13316             Richards Town      4 BHK       3600   5.0  400.00    4
13317     Raja Rajeshwari Nagar      2 BHK       1141   2.0   60.00    2
13318           Padmanabhanagar      4 BHK       4689   4.0  488.00    4
13319              Doddathoguru      1 BHK        550   1.0   17.00    1

[13056 rows x 6 columns]

In [17]:
def convert_Sqft_num(x):
    token = x.split('-')
    if len(token) == 2:
        return (float(token[0]) + float(token[1])) / 2
    try:
        return float(x)
    except:
        return None

In [18]:
# convert_Sqft_num('34.46Sq. Meter')
df2.shape

(13246, 6)

In [19]:
df3 = df2.copy()
df3['total_sqft'] = df3['total_sqft'].apply(convert_Sqft_num)
df3.head()

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

In [20]:
df4 = df3.copy()

In [21]:
df4['price_per_sqft'] = df4['price'] * 100000/df4['total_sqft']

In [22]:
df4.location = df4.location.apply(lambda x: x.strip())

In [23]:
location_status = df4.groupby('location')['location'].agg('count')
location_status.sort_values(ascending=False)

location
Whitefield               535
Sarjapur  Road           392
Electronic City          304
Kanakpura Road           266
Thanisandra              236
                        ...
1 Giri Nagar               1
Kanakapura Road,           1
Kanakapura main  Road      1
Karnataka Shabarimala      1
whitefiled                 1
Name: location, Length: 1293, dtype: int64

In [24]:
### Their is some data points which are having 1 data points so we can call it as other location 

len(location_status[location_status <= 10])

1052

In [25]:
location_status_less_than_10 = location_status[location_status <= 10]
location_status_less_than_10

location
1 Annasandrapalya                                  1
1 Giri Nagar                                       1
1 Immadihalli                                      1
1 Ramamurthy Nagar                                 1
12th cross srinivas nagar banshankari 3rd stage    1
                                                  ..
t.c palya                                          1
tc.palya                                           4
vinayakanagar                                      1
white field,kadugodi                               1
whitefiled                                         1
Name: location, Length: 1052, dtype: int64

In [26]:
df4.location = df4.location.apply(lambda x: 'other' if x in location_status_less_than_10 else x)
df4

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000
...,...,...,...,...,...,...,...
13315,Whitefield,5 Bedroom,3453.0,4.0,231.00,5,6689.834926
13316,other,4 BHK,3600.0,5.0,400.00,4,11111.111111
13317,Raja Rajeshwari Nagar,2 BHK,1141.0,2.0,60.00,2,5258.545136
13318,Padmanabhanagar,4 BHK,4689.0,4.0,488.00,4,10407.336319
13319,Doddathoguru,1 BHK,550.0,1.0,17.00,1,3090.909091

In [27]:
### Now Handling the outliers 

print(df4.shape)

(13246, 7)

In [28]:
df5 = df4[~(df4.total_sqft/df4.bhk <= 300)]
df5.shape

(12320, 7)

In [29]:
df5.price_per_sqft.describe()

count     12274.000000
mean       6211.880230
std        4053.214807
min         267.829813
25%        4200.000000
50%        5263.157895
75%        6825.474875
max      176470.588235
Name: price_per_sqft, dtype: float64

In [30]:
### To handle the minimum price per sqft and maximum we are going to use IQR Technique

Q1 = df5.quantile(0.25)
Q3 = df5.quantile(0.75)

### Taking IQR 

IQR = Q3 - Q1
df5 = df5[~(df5 < (Q1 - 1.5 * IQR)) | (df5 > (Q3 + 1.5 * IQR))]

<ipython-input-30-03f629778334>:9: FutureWarning: Automatic reindexing on DataFrame vs Series comparisons is deprecated and will raise ValueError in a future version.  Do `left, right = left.align(right, axis=1, copy=False)` before e.g. `left == right`
  df5 = df5[~(df5 < (Q1 - 1.5 * IQR)) | (df5 > (Q3 + 1.5 * IQR))]
<ipython-input-30-03f629778334>:9: FutureWarning: Automatic reindexing on DataFrame vs Series comparisons is deprecated and will raise ValueError in a future version.  Do `left, right = left.align(right, axis=1, copy=False)` before e.g. `left == right`
  df5 = df5[~(df5 < (Q1 - 1.5 * IQR)) | (df5 > (Q3 + 1.5 * IQR))]

In [31]:
df5.isnull().sum()

location           0
size               0
total_sqft        46
bath               0
price              0
bhk                0
price_per_sqft    46
dtype: int64

In [32]:
df5.total_sqft = df5.total_sqft.ffill()
df5.price_per_sqft = df5.price_per_sqft.fillna('mean')
df5.isnull().sum()

location          0
size              0
total_sqft        0
bath              0
price             0
bhk               0
price_per_sqft    0
dtype: int64

In [33]:
### Now checking the bathroom column if bathroom column is greater than bhk + 2 then it's an outlier

df5 = df5.drop(['size', 'price_per_sqft'], axis = 'columns')
df5.head()

                   location  total_sqft  bath   price  bhk
0  Electronic City Phase II      1056.0   2.0   39.07    2
1          Chikka Tirupathi      2600.0   5.0  120.00    4
2               Uttarahalli      1440.0   2.0   62.00    3
3        Lingadheeranahalli      1521.0   3.0   95.00    3
4                  Kothanur      1200.0   2.0   51.00    2

In [34]:
df5[df5.bath < df5.bhk + 2]

                       location  total_sqft  bath   price  bhk
0      Electronic City Phase II      1056.0   2.0   39.07    2
1              Chikka Tirupathi      2600.0   5.0  120.00    4
2                   Uttarahalli      1440.0   2.0   62.00    3
3            Lingadheeranahalli      1521.0   3.0   95.00    3
4                      Kothanur      1200.0   2.0   51.00    2
...                         ...         ...   ...     ...  ...
13315                Whitefield      3453.0   4.0  231.00    5
13316                     other      3600.0   5.0  400.00    4
13317     Raja Rajeshwari Nagar      1141.0   2.0   60.00    2
13318           Padmanabhanagar      4689.0   4.0  488.00    4
13319              Doddathoguru       550.0   1.0   17.00    1

[12173 rows x 5 columns]

In [35]:
df6 = df5[df5.bath < df5.bhk + 2]

In [36]:
df6.shape

(12173, 5)

In [37]:
dummies = pd.get_dummies(df6.location)
dummies.head()

,1st Block Jayanagar,1st Phase JP Nagar,2nd Phase Judicial Layout,2nd Stage Nagarbhavi,5th Block Hbr Layout,5th Phase JP Nagar,6th Phase JP Nagar,7th Phase JP Nagar,8th Phase JP Nagar,9th Phase JP Nagar,...,Vishveshwarya Layout,Vishwapriya Layout,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yelenahalli,Yeshwanthpur,other
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [38]:
df7 = pd.concat([df6.drop('location', axis = 'columns'), dummies.drop('other', axis = 'columns')], axis = 'columns')

In [39]:
df7.head()

,total_sqft,bath,price,bhk,1st Block Jayanagar,1st Phase JP Nagar,2nd Phase Judicial Layout,2nd Stage Nagarbhavi,5th Block Hbr Layout,5th Phase JP Nagar,...,Vijayanagar,Vishveshwarya Layout,Vishwapriya Layout,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yelenahalli,Yeshwanthpur
0,1056.0,2.0,39.07,2,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2600.0,5.0,120.00,4,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1440.0,2.0,62.00,3,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1521.0,3.0,95.00,3,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1200.0,2.0,51.00,2,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [40]:
#### Now creating model

X = df7.drop('price', axis = 'columns')
y = df7.price

In [41]:
X.total_sqft = X.total_sqft.astype('float32')
X.shape

(12173, 244)

In [42]:
from sklearn.model_selection import train_test_split, cross_validate, ShuffleSplit, GridSearchCV
from sklearn.linear_model import LinearRegression, Lasso
from sklearn.ensemble import RandomForestRegressor
from sklearn.tree import DecisionTreeRegressor

In [43]:
def find_best_model_using_gridSearch(x, y):
    
    algorithms = {
        'linear_regression' : {
            'model' : LinearRegression(),
            'params' : {
                'normalize' : [True, False]
            }
        },
        
        'lasso' :{ 
            'model' : Lasso(),
            'params' : {
                'alpha' : [1, 2],
                'selection' : ['random', 'cyclic']
            }
        },
        
        'decission_tree' : {
            'model' : DecisionTreeRegressor(),
            'params' : {
                'criterion' : ['mse', 'friedman_mse'],
                'splitter' : ['best', 'random']
            }
        },
        
        'randomforest' : {
            'model' : RandomForestRegressor(),
            'params' : {
                'n_estimators' : [100],
                'oob_score' : [True, False],
            }
        }
    }
    scores = []
    cv = ShuffleSplit(n_splits = 5, test_size = 0.2, random_state=0)
    for algo_name, config in algorithms.items():
        gs = GridSearchCV(config['model'], config['params'], cv = cv, return_train_score = False)
        gs.fit(X, y)
        scores.append({
            'model' : algo_name,
            'best_score' : gs.best_score_,
            'best_params' : gs.best_params_
        })
    return pd.DataFrame(scores, columns = ['model', 'best_score', 'best_params'])

find_best_model_using_gridSearch(X, y)

               model  best_score                                best_params
0  linear_regression    0.429330                       {'normalize': False}
1              lasso    0.385074        {'alpha': 1, 'selection': 'cyclic'}
2     decission_tree    0.274326   {'criterion': 'mse', 'splitter': 'best'}
3       randomforest    0.522347  {'n_estimators': 100, 'oob_score': False}

In [44]:
RF = RandomForestRegressor(n_estimators=100, oob_score=True)
RF.fit(X, y)

RandomForestRegressor(oob_score=True)

In [45]:
RF.score(X, y)

0.9041519857636247

In [46]:
def predict_price(location, sqft, bath, bhk):
    loc_index = np.where(X.columns == location)[0][0]
    
    x = np.zeros(len(X.columns))
    x[0] = sqft
    x[1] = bath
    x[2] = bhk
    
    if loc_index >= 0:
        x[loc_index] = 1
        
    return RF.predict([x])[0]

In [47]:
predict_price('Rajaji Nagar', 1640, 3, 3)

238.99894726317717

In [48]:
import pickle

with open('banglore_home_Price_model.pickle', 'wb') as f:
    pickle.dump(RF, f)

In [49]:
import json

columns = {
    'data_columns' : [col.lower() for col in X.columns]
}

with open('columns.json', 'w') as f:
    f.write(json.dumps(columns))